: $<D1b7Rd3b2>,<Rm4b6>
  s"  "  $>指令
  $<D1b7Rd3b2>
  s" ,"  $>指令 
  $<Rm4b6>
  ;

: $<Rd3b10>,#<imm8b7> 
  s"  "  $>指令
  $<Rd3b10>
  $#<imm8b7>
  ;

: $<Rd4b11>,<Rn4b19>,#<Imm1b26:Imm3b14:Imm8b7>
  s"  "  $>指令
  $<Rd4b11>
  s" ,"  $>指令  
  $<Rn4b19> 
  $#<Imm1b26:Imm3b14:Imm8b7>
  ;

: $<Rd4b11>,<Rn4b19>,#<Imm1b26:Imm8b7>
  s"  "  $>指令
  $<Rd4b11>
  s" ,"  $>指令  
  $<Rn4b19> 
  $#<Imm1b26:Imm8b7>
  ;

: $<Rdn3b2>,<Rm3b5>
  s"  "  $>指令
  $<Rdn3b2>
  s" ,"  $>指令  
  $<Rm3b5>
  ;
  
  
: $[PC,#<imm8b7>]
  s" ["  $>指令
  s" PC"  $>指令
  $#<imm8b7>  
  s" ]"  $>指令
  ; 
  
: $[SP,#<imm8b7>]
  s" ["  $>指令
  s" SP"  $>指令
  $#<imm8b7>  
  s" ]"  $>指令
  ;   
  
  
: $[<Rn3b5>,#<imm5b10>]
  s" ["  $>指令
  $<Rn3b5>
  $#<imm5b10>
  s" ]"  $>指令  
  ; 
  
: $<Rt3b2>,[<Rn3b5>,#<imm5b10>]
  s"  "  $>指令
  $<Rt3b2>
  s" ,"  $>指令  
  $[<Rn3b5>,#<imm5b10>]
  ;  
  
  
: $<Rt3b10>,[PC,#<imm8b7>]       
  s"  "  $>指令
  $<Rt3b10>
  s" ,"  $>指令   
  $[PC,#<imm8b7>]       
  ; 
  
: $<Rt3b10>,[SP,#<imm8b7>]
  s"  "  $>指令
  $<Rt3b10>
  s" ,"  $>指令   
  $[SP,#<imm8b7>]       
  ;  
    
: $[<Rn4b19>,#<imm8b7>]
  s" ["  $>指令
  $<Rn4b19>
  $#<imm8b7>     
  s" ]"  $>指令 
  ;  
  
: $<Rt4b15>,[<Rn4b19>,#<imm8b7>] 
  s"  "  $>指令
  $<Rt4b15>
  s" ,"  $>指令
  $[<Rn4b19>,#<imm8b7>]    
  ;  
  
: $<Rt4b15>,[<Rn4b19>,#<imm8b7>]!
  $<Rt4b15>,[<Rn4b19>,#<imm8b7>]
  s" !"  $>指令   
  ;
    
: $[<Rn4b19>]
  s" ["  $>指令 
  $<Rn4b19>
  s" ]"  $>指令    
  ;
    
 
        
: $<Rt4b15>,[<Rn4b19>],#<imm8b7>
  s"  "  $>指令
  $<Rt4b15>
  s" ,"  $>指令  
  $[<Rn4b19>]
  $#<imm8b7> 
  ;  
    

  
: $[<Rn3b5>,<Rm3b8>]
  s" ["  $>指令  
  $<Rn3b5>
  s" ,"  $>指令   
  $<Rm3b8>
  s" ]"  $>指令 
 ;
    
: $<Rt3b2>,[<Rn3b5>,<Rm3b8>]
  s"  "  $>指令
  $<Rt3b2>
  s" ,"  $>指令  
  $[<Rn3b5>,<Rm3b8>]    
  ;    
  
  